src/Enums/ВидыОперацийЗаказПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыОперацийЗаказПокупателя</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПродажу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаряд</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыОперацийРасходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРасходнаяНакладная</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПродажаПокупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаНаКомиссию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаНаОтветХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратКомитенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзПереработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСОтветХранения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыОперацийПриходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПриходнаяНакладная</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемНаКомиссию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемВПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемНаОтветХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтКомиссионера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПереработчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСОтветХранения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтатусыЧековККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>СтатусыЧековККМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТоварЗарезервирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пробит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧекНеПробит</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыОперацийЭквайринга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыОперацийЭквайринга</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОплатыОтПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыПокупателю</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ПередачаВА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ПередачаВА</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияВнеоборотныхАктивов</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыИРасходыКассовыйМетод</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПокупателями</xr:Item>
				<xr:Item>AccumulationRegister.Запасы</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыИРасходы</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыИРасходыОтложенные</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыИРасходыКассовыйМетодЭквайринг</xr:Item>
				<xr:Item>AccumulationRegister.ВнеоборотныеАктивы</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыИРасходыНераспределенные</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСВключатьВСтоимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСменыККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧекаККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпециальныйНалоговыйРежим</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпециальныеНалоговыеРежимы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьКассира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВнеоборотныеАктивы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВнеоборотныйАктив</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВнеоборотныеАктивы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстаточнаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Амортизация</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АмортизацияЗаМесяц</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>Ставка НДС</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>Сумма НДС</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Comment>Всего</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Предоплата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеВКассу</v8:Type>
								<v8:Type>cfg:DocumentRef.Взаимозачет</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеНаСчет</v8:Type>
								<v8:Type>cfg:DocumentRef.ОперацияПоПлатежнымКартам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРасчетов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кратность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Catalogs/ВидыЗаказовПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ВидыЗаказовПокупателей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеДоставлен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеОтгружен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеОжидаетОтгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользоватьДоставку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПорядокСостояний</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonForms/ФормаВыборДокументаРасчетов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоРасчетыСПокупателями = Параметры.ЭтоРасчетыСПокупателями;
	ТипДокумента = Параметры.ТипДокумента;
	СтрокаИсключений = "";
	Параметры.Свойство("СтрокаИсключений", СтрокаИсключений);
	
	ОтборПоДоговору = Параметры.Отбор.Свойство("Договор");
	Если ОтборПоДоговору Тогда
		Договор = Параметры.Отбор.Договор;
	Иначе
		Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	Если ТипДокумента = Тип("ДокументСсылка.ПоступлениеНаСчет")
		ИЛИ ТипДокумента = Тип("ДокументСсылка.ПоступлениеВКассу") Тогда
		
		Если ЭтоРасчетыСПокупателями Тогда
			Список.ТекстЗапроса = ПолучитьТекстЗапросаДокументыРасчетовСПокупателямиПоступление(ОтборПоДоговору);
		Иначе
			Список.ТекстЗапроса = ПолучитьТекстЗапросаДокументыРасчетовСПоставщикамиПоступление(ОтборПоДоговору);
			Список.Параметры.УстановитьЗначениеПараметра("КонтрагентПоУмолчанию", Параметры.Отбор.Контрагент);
		КонецЕсли;
		
	Иначе
		
		Если ЭтоРасчетыСПокупателями Тогда
			Список.ТекстЗапроса = ПолучитьТекстЗапросаДокументыРасчетовСПокупателямиСписание(ОтборПоДоговору, СтрокаИсключений);
		Иначе
			Список.ТекстЗапроса = ПолучитьТекстЗапросаДокументыРасчетовСПоставщикамиСписание(ОтборПоДоговору);
		КонецЕсли;
		
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("ДоговорПоУмолчанию", Договор);
	
	ДинамическиеСпискиУНФ.ОтображатьТолькоВремяДляТекущейДаты(Список);
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОповещениеОбИзмененииДолга" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("Документ", ТекущиеДанные.Ссылка);
	ДанныеДокумента.Вставить("Договор", ТекущиеДанные.Договор);
	
	ДанныеДокумента.Вставить("Заказ", Неопределено);
	ДанныеДокумента.Вставить("СчетНаОплату", Неопределено);
	ДанныеДокумента.Вставить("УстановитьЗаказ", Ложь);
	
	УчетРасчетовСКонтрагентами.ПолучитьЗаказИСчетНаОПлатуПоДокументу(ДанныеДокумента, ЭтоРасчетыСПокупателями);
	
	ОповеститьОВыборе(ДанныеДокумента);
	
КонецПроцедуры // СписокВыбор()

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура вызывается при нажатии на кнопку "Выбрать".
//
&НаКлиенте
Процедура ВыбратьДокумент(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		ДанныеДокумента = Новый Структура;
		ДанныеДокумента.Вставить("Документ", ТекущиеДанные.Ссылка);
		ДанныеДокумента.Вставить("Договор", ТекущиеДанные.Договор);
		
		ДанныеДокумента.Вставить("Заказ", Неопределено);
		ДанныеДокумента.Вставить("СчетНаОплату", Неопределено);
		ДанныеДокумента.Вставить("УстановитьЗаказ", Ложь);
		
		УчетРасчетовСКонтрагентами.ПолучитьЗаказИСчетНаОПлатуПоДокументу(ДанныеДокумента, ЭтоРасчетыСПокупателями);
		
		ОповеститьОВыборе(ДанныеДокумента);
	Иначе
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры // ВыбратьДокумент()

// Процедура вызывается при нажатии на кнопку "Открыть документ".
//
&НаКлиенте
Процедура ОткрытьДокумент(Команда)
	
	СтрокаТаблицы = Элементы.Список.ТекущиеДанные;
	Если СтрокаТаблицы <> Неопределено Тогда
		ПоказатьЗначение(Неопределено,СтрокаТаблицы.Ссылка);
	КонецЕсли;
	
КонецПроцедуры // ОткрытьДокумент()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получает запрос для выбора документов расчетов с покупателями 
// для документов "Поступление на счет" и "Поступление в кассу".
//
&НаСервереБезКонтекста
Функция ПолучитьТекстЗапросаДокументыРасчетовСПокупателямиПоступление(ОтборПоДоговору)
	
	ТекстЗапроса = "";
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.АктВыполненныхРабот) Тогда
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка КАК Ссылка,
		|	ДанныеДокумента.Дата КАК Дата,
		|	ДанныеДокумента.Номер КАК Номер,
		|	ДанныеДокумента.Организация КАК Организация,
		|	ДанныеДокумента.Контрагент КАК Контрагент,
		|	ДанныеДокумента.Договор КАК Договор,
		|	ДанныеДокумента.СуммаДокумента КАК Сумма,
		|	ДанныеДокумента.ВалютаДокумента КАК Валюта,
		|	ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка) КАК Тип,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Проведен
		|			ТОГДА 1
		|		КОГДА ДанныеДокумента.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СостояниеДокумента
		|ИЗ
		|	Документ.АктВыполненныхРабот КАК ДанныеДокумента
		|";
		
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.ЗаказПокупателя) Тогда
		ТекстЗапросаПоЗаказамПокупателей = "ОБЪЕДИНИТЬ ВСЕ" +
		"
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка КАК Ссылка,
		|	ДанныеДокумента.Дата КАК Дата,
		|	ДанныеДокумента.Номер КАК Номер,
		|	ДанныеДокумента.Организация КАК Организация,
		|	ДанныеДокумента.Контрагент КАК Контрагент,
		|	ДанныеДокумента.Договор КАК Договор,
		|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента,
		|	ДанныеДокумента.ВалютаДокумента КАК ВалютаДокумента,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.ВидЗаказа) = ТИП(Справочник.ВидыЗаказовПокупателей)
		|			ТОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка)
		|		ИНАЧЕ ""Заказ-наряд""
		|	КОНЕЦ КАК Поле1,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Проведен
		|			ТОГДА 1
		|		КОГДА ДанныеДокумента.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Поле2
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ДанныеДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЗаказНарядов.ПорядокСостояний КАК ВидыЗаказНарядовПорядокСостояний
		|		ПО ДанныеДокумента.ВидЗаказа = ВидыЗаказНарядовПорядокСостояний.Ссылка
		|			И ДанныеДокумента.СостояниеЗаказа = ВидыЗаказНарядовПорядокСостояний.Состояние
		|ГДЕ
		|	ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаряд)
		|	И ВидыЗаказНарядовПорядокСостояний.НомерСтроки >= ВЫРАЗИТЬ(ДанныеДокумента.ВидЗаказа КАК Справочник.ВидыЗаказНарядов).НомерСостоянияВыполнения
		|";
		
		
		ТекстЗапросаПоЗаказамПокупателей = СтрЗаменить(ТекстЗапросаПоЗаказамПокупателей, "Заказ-наряд", НСтр("ru = 'Заказ-наряд'"));
		
		ТекстЗапроса = ТекстЗапроса + ТекстЗапросаПоЗаказамПокупателей;
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.Взаимозачет) Тогда
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" +
		"
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка,
		|	ДанныеДокумента.Дата,
		|	ДанныеДокумента.Номер,
		|	ДанныеДокумента.Организация,
		|	ДанныеДокумента.Контрагент,
		|	&ДоговорПоУмолчанию,
		|	ДанныеДокумента.СуммаРасчетов,
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
		|	ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка),
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Проведен
		|			ТОГДА 1
		|		КОГДА ДанныеДокумента.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	Документ.Взаимозачет КАК ДанныеДокумента
		|";
		
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.ОтчетКомиссионера) Тогда
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" +
		"
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка,
		|	ДанныеДокумента.Дата,
		|	ДанныеДокумента.Номер,
		|	ДанныеДокумента.Организация,
		|	ДанныеДокумента.Контрагент,
		|	ДанныеДокумента.Договор,
		|	ДанныеДокумента.СуммаДокумента,
		|	ДанныеДокумента.ВалютаДокумента,
		|	ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка),
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Проведен
		|			ТОГДА 1
		|		КОГДА ДанныеДокумента.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	Документ.ОтчетКомиссионера КАК ДанныеДокумента
		|";
		
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.ОтчетОПереработке) Тогда
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" +
		"
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка,
		|	ДанныеДокумента.Дата,
		|	ДанныеДокумента.Номер,
		|	ДанныеДокумента.Организация,
		|	ДанныеДокумента.Контрагент,
		|	ДанныеДокумента.Договор,
		|	ДанныеДокумента.СуммаДокумента,
		|	ДанныеДокумента.ВалютаДокумента,
		|	ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка),
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Проведен
		|			ТОГДА 1
		|		КОГДА ДанныеДокумента.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	Документ.ОтчетОПереработке КАК ДанныеДокумента
		|";
		
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.ПередачаВА) Тогда
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" +
		"
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка,
		|	ДанныеДокумента.Дата,
		|	ДанныеДокумента.Номер,
		|	ДанныеДокумента.Организация,
		|	ДанныеДокумента.Контрагент,
		|	ДанныеДокумента.Договор,
		|	ДанныеДокумента.СуммаДокумента,
		|	ДанныеДокумента.ВалютаДокумента,
		|	ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка),
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Проведен
		|			ТОГДА 1
		|		КОГДА ДанныеДокумента.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	Документ.ПередачаВА КАК ДанныеДокумента
		|";
		
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.РасходнаяНакладная) Тогда
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" +
		"
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка,
		|	ДанныеДокумента.Дата,
		|	ДанныеДокумента.Номер,
		|	ДанныеДокумента.Организация,
		|	ДанныеДокумента.Контрагент,
		|	ДанныеДокумента.Договор,
		|	ДанныеДокумента.СуммаДокумента,
		|	ДанныеДокумента.ВалютаДокумента,
		|	ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка),
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Проведен
		|			ТОГДА 1
		|		КОГДА ДанныеДокумента.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	Документ.РасходнаяНакладная КАК ДанныеДокумента
		|";
		
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.ПриемИПередачаВРемонт) Тогда
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" +
		"
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка,
		|	ДанныеДокумента.Дата,
		|	ДанныеДокумента.Номер,
		|	ДанныеДокумента.Организация,
		|	ДанныеДокумента.Контрагент,
		|	Null,
		|	ДанныеДокумента.СуммаДокумента,
		|	ДанныеДокумента.ВалютаДокумента,
		|	ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка),
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Проведен
		|			ТОГДА 1
		|		КОГДА ДанныеДокумента.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	Документ.ПриемИПередачаВРемонт КАК ДанныеДокумента
		|";
		
	КонецЕсли;
	
	// Интеркампани
	Если ПравоДоступа("Чтение", Метаданные.Документы.ПередачаТоваровМеждуОрганизациями) Тогда
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" +
		"
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка,
		|	ДанныеДокумента.Дата,
		|	ДанныеДокумента.Номер,
		|	ДанныеДокумента.Организация,
		|	ДанныеДокумента.КонтрагентПолучатель,
		|	ДанныеДокумента.Договор,
		|	ДанныеДокумента.СуммаДокумента,
		|	ДанныеДокумента.ВалютаДокумента,
		|	ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка),
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Проведен
		|			ТОГДА 1
		|		КОГДА ДанныеДокумента.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	Документ.ПередачаТоваровМеждуОрганизациями КАК ДанныеДокумента
		|";
		
	КонецЕсли;
	// Конец Интеркампани
	
	Если Лев(ТекстЗапроса, 10) = "ОБЪЕДИНИТЬ" Тогда
		ТекстЗапроса = Сред(ТекстЗапроса, 14);
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции // ПолучитьТекстЗапросаДокументыРасчетовСПокупателями()

// Получает запрос для выбора документов расчетов с поставщиками 
// для документов "Поступление на счет" и "Поступление в кассу".
//
&НаСервереБезКонтекста
Функция ПолучитьТекстЗапросаДокументыРасчетовСПоставщикамиПоступление(ОтборПоДоговору)
	
	ТекстЗапроса = "";
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.АвансовыйОтчет) Тогда
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка КАК Ссылка,
		|	ДанныеДокумента.Дата КАК Дата,
		|	ДанныеДокумента.Номер КАК Номер,
		|	ДанныеДокумента.Организация КАК Организация,
		|	&КонтрагентПоУмолчанию КАК Контрагент,
		|	&ДоговорПоУмолчанию КАК Договор,
		|	ДанныеДокумента.СуммаДокумента КАК Сумма,
		|	ДанныеДокумента.ВалютаДокумента КАК Валюта,
		|	ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка) КАК Тип,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Проведен
		|			ТОГДА 1
		|		КОГДА ДанныеДокумента.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СостояниеДокумента
		|ИЗ
		|	Документ.АвансовыйОтчет КАК ДанныеДокумента
		|";
		
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.ДополнительныеРасходы) Тогда
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" +
		"
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка,
		|	ДанныеДокумента.Дата,
		|	ДанныеДокумента.Номер,
		|	ДанныеДокумента.Организация,
		|	ДанныеДокумента.Контрагент,
		|	ДанныеДокумента.Договор,
		|	ДанныеДокумента.СуммаДокумента,
		|	ДанныеДокумента.ВалютаДокумента,
		|	ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка),
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Проведен
		|			ТОГДА 1
		|		КОГДА ДанныеДокумента.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	Документ.ДополнительныеРасходы КАК ДанныеДокумента
		|";
		
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.Взаимозачет) Тогда
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" +
		"
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка,
		|	ДанныеДокумента.Дата,
		|	ДанныеДокумента.Номер,
		|	ДанныеДокумента.Организация,
		|	ДанныеДокумента.Контрагент,
		|	&ДоговорПоУмолчанию,
		|	ДанныеДокумента.СуммаРасчетов,
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
		|	ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка),
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Проведен
		|			ТОГДА 1
		|		КОГДА ДанныеДокумента.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	Документ.Взаимозачет КАК ДанныеДокумента
		|";
		
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.ОтчетКомитенту) Тогда
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" +
		"
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка,
		|	ДанныеДокумента.Дата,
		|	ДанныеДокумента.Номер,
		|	ДанныеДокумента.Организация,
		|	ДанныеДокумента.Контрагент,
		|	ДанныеДокумента.Договор,
		|	ДанныеДокумента.СуммаДокумента,
		|	ДанныеДокумента.ВалютаДокумента,
		|	ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка),
		|	ВЫБОР КОГДА ДанныеДокумента.Проведен ТОГДА
		|		1
		|	КОГДА ДанныеДокумента.ПометкаУдаления ТОГДА
		|		2
		|	ИНАЧЕ
		|		0
		|	КОНЕЦ
		|ИЗ
		|	Документ.ОтчетКомитенту КАК ДанныеДокумента
		|";
		
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.ОтчетПереработчика) Тогда
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" +
		"
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка,
		|	ДанныеДокумента.Дата,
		|	ДанныеДокумента.Номер,
		|	ДанныеДокумента.Организация,
		|	ДанныеДокумента.Контрагент,
		|	ДанныеДокумента.Договор,
		|	ДанныеДокумента.Сумма,
		|	ДанныеДокумента.ВалютаДокумента,
		|	ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка),
		|	ВЫБОР КОГДА ДанныеДокумента.Проведен ТОГДА
		|		1
		|	КОГДА ДанныеДокумента.ПометкаУдаления ТОГДА
		|		2
		|	ИНАЧЕ
		|		0
		|	КОНЕЦ
		|ИЗ
		|	Документ.ОтчетПереработчика КАК ДанныеДокумента
		|";
		
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.ПриходнаяНакладная) Тогда
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" +
		"
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка,
		|	ДанныеДокумента.Дата,
		|	ДанныеДокумента.Номер,
		|	ДанныеДокумента.Организация,
		|	ДанныеДокумента.Контрагент,
		|	ДанныеДокумента.Договор,
		|	ДанныеДокумента.СуммаДокумента,
		|	ДанныеДокумента.ВалютаДокумента,
		|	ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка),
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Проведен
		|			ТОГДА 1
		|		КОГДА ДанныеДокумента.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	Документ.ПриходнаяНакладная КАК ДанныеДокумента
		|";
		
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.РасходнаяНакладная) Тогда
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" +
		"
		|ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка,
		|	РасходнаяНакладная.Дата,
		|	РасходнаяНакладная.Номер,
		|	РасходнаяНакладная.Организация,
		|	РасходнаяНакладная.Контрагент,
		|	РасходнаяНакладная.Договор,
		|	РасходнаяНакладная.СуммаДокумента,
		|	РасходнаяНакладная.ВалютаДокумента,
		|	ТИПЗНАЧЕНИЯ(РасходнаяНакладная.Ссылка),
		|	ВЫБОР
		|		КОГДА РасходнаяНакладная.Проведен
		|			ТОГДА 1
		|		КОГДА РасходнаяНакладная.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	(РасходнаяНакладная.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
		|			ИЛИ РасходнаяНакладная.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту)
		|			ИЛИ РасходнаяНакладная.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратИзПереработки)
		|			ИЛИ РасходнаяНакладная.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратСОтветХранения))
		|";
		
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.РасходИзКассы) Тогда
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" +
		"
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка,
		|	ДанныеДокумента.Дата,
		|	ДанныеДокумента.Номер,
		|	ДанныеДокумента.Организация,
		|	ДанныеДокумента.Контрагент,
		|	&ДоговорПоУмолчанию,
		|	ДанныеДокумента.СуммаДокумента,
		|	ДанныеДокумента.ВалютаДенежныхСредств,
		|	ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка),
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Проведен
		|			ТОГДА 1
		|		КОГДА ДанныеДокумента.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	Документ.РасходИзКассы КАК ДанныеДокумента
		|";
		
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.РасходСоСчета) Тогда
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" +
		"
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка,
		|	ДанныеДокумента.Дата,
		|	ДанныеДокумента.Номер,
		|	ДанныеДокумента.Организация,
		|	ДанныеДокумента.Контрагент,
		|	&ДоговорПоУмолчанию,
		|	ДанныеДокумента.СуммаДокумента,
		|	ДанныеДокумента.ВалютаДенежныхСредств,
		|	ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка),
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Проведен
		|			ТОГДА 1
		|		КОГДА ДанныеДокумента.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	Документ.РасходСоСчета КАК ДанныеДокумента
		|";
		
	КонецЕсли;
	
	// Интеркампани
	Если ПравоДоступа("Чтение", Метаданные.Документы.ПередачаТоваровМеждуОрганизациями) Тогда
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" +
		"
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка,
		|	ДанныеДокумента.Дата,
		|	ДанныеДокумента.Номер,
		|	ДанныеДокумента.ОрганизацияПолучатель,
		|	ДанныеДокумента.КонтрагентВладелец,
		|	ДанныеДокумента.Договор,
		|	ДанныеДокумента.СуммаДокумента,
		|	ДанныеДокумента.ВалютаДокумента,
		|	ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка),
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Проведен
		|			ТОГДА 1
		|		КОГДА ДанныеДокумента.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	Документ.ПередачаТоваровМеждуОрганизациями КАК ДанныеДокумента
		|";
		
	КонецЕсли;
	// Конец Интеркампани
	
	Если Лев(ТекстЗапроса, 10) = "ОБЪЕДИНИТЬ" Тогда
		ТекстЗапроса = Сред(ТекстЗапроса, 14);
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции // ПолучитьТекстЗапросаДокументыРасчетовСПоставщиками()

// Получает запрос для выбора документов расчетов с покупателями 
// для документов "Расход со счета" и "Расход из кассы".
//
&НаСервереБезКонтекста
Функция ПолучитьТекстЗапросаДокументыРасчетовСПокупателямиСписание(ОтборПоДоговору, СтрокаИсключений)
	
	ТекстЗапроса = "";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	НЕОПРЕДЕЛЕНО КАК Ссылка,
	|	НЕОПРЕДЕЛЕНО КАК Дата,
	|	НЕОПРЕДЕЛЕНО КАК Номер,
	|	НЕОПРЕДЕЛЕНО КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК Контрагент,
	|	НЕОПРЕДЕЛЕНО КАК Договор,
	|	НЕОПРЕДЕЛЕНО КАК Сумма,
	|	НЕОПРЕДЕЛЕНО КАК Валюта,
	|	НЕОПРЕДЕЛЕНО КАК Тип,
	|	НЕОПРЕДЕЛЕНО КАК СостояниеДокумента
	|ГДЕ
	|	ЛОЖЬ
	|";
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.ПоступлениеВКассу) И СтрНайти(СтрокаИсключений, "ПоступлениеВКассу") = 0 Тогда
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" +
		"
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка КАК Ссылка,
		|	ДанныеДокумента.Дата КАК Дата,
		|	ДанныеДокумента.Номер КАК Номер,
		|	ДанныеДокумента.Организация КАК Организация,
		|	ДанныеДокумента.Контрагент КАК Контрагент,
		|	&ДоговорПоУмолчанию КАК Договор,
		|	ДанныеДокумента.СуммаДокумента КАК Сумма,
		|	ДанныеДокумента.ВалютаДенежныхСредств КАК Валюта,
		|	ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка) КАК Тип,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Проведен
		|			ТОГДА 1
		|		КОГДА ДанныеДокумента.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СостояниеДокумента
		|ИЗ
		|	Документ.ПоступлениеВКассу КАК ДанныеДокумента
		|";
		
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.ПоступлениеНаСчет) И СтрНайти(СтрокаИсключений, "ПоступлениеНаСчет") = 0 Тогда
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" +
		"
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка,
		|	ДанныеДокумента.Дата,
		|	ДанныеДокумента.Номер,
		|	ДанныеДокумента.Организация,
		|	ДанныеДокумента.Контрагент,
		|	&ДоговорПоУмолчанию КАК Договор,
		|	ДанныеДокумента.СуммаДокумента КАК Сумма,
		|	ДанныеДокумента.ВалютаДенежныхСредств,
		|	ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка),
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Проведен
		|			ТОГДА 1
		|		КОГДА ДанныеДокумента.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	Документ.ПоступлениеНаСчет КАК ДанныеДокумента
		|";
		
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.АктВыполненныхРабот) И СтрНайти(СтрокаИсключений, "АктВыполненныхРабот") = 0 Тогда
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" +
		"
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка,
		|	ДанныеДокумента.Дата,
		|	ДанныеДокумента.Номер,
		|	ДанныеДокумента.Организация,
		|	ДанныеДокумента.Контрагент,
		|	ДанныеДокумента.Договор,
		|	ДанныеДокумента.СуммаДокумента КАК Сумма,
		|	ДанныеДокумента.ВалютаДокумента,
		|	ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка),
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Проведен
		|			ТОГДА 1
		|		КОГДА ДанныеДокумента.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	Документ.АктВыполненныхРабот КАК ДанныеДокумента
		|";
		
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.Взаимозачет) И СтрНайти(СтрокаИсключений, "Взаимозачет") = 0 Тогда
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" +
		"
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка,
		|	ДанныеДокумента.Дата,
		|	ДанныеДокумента.Номер,
		|	ДанныеДокумента.Организация,
		|	ДанныеДокумента.Контрагент,
		|	&ДоговорПоУмолчанию КАК Договор,
		|	ДанныеДокумента.СуммаРасчетов КАК Сумма,
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
		|	ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка),
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Проведен
		|			ТОГДА 1
		|		КОГДА ДанныеДокумента.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	Документ.Взаимозачет КАК ДанныеДокумента
		|";
		
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.ЗаказПокупателя) И СтрНайти(СтрокаИсключений, "ЗаказПокупателя") = 0 Тогда
		ТекстЗапросаПоЗаказамПокупателей = "ОБЪЕДИНИТЬ ВСЕ" +
		"
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка КАК Ссылка,
		|	ДанныеДокумента.Дата КАК Дата,
		|	ДанныеДокумента.Номер КАК Номер,
		|	ДанныеДокумента.Организация КАК Организация,
		|	ДанныеДокумента.Контрагент КАК Контрагент,
		|	ДанныеДокумента.Договор КАК Договор,
		|	ДанныеДокумента.СуммаДокумента КАК Сумма,
		|	ДанныеДокумента.ВалютаДокумента КАК ВалютаДокумента,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.ВидЗаказа) = ТИП(Справочник.ВидыЗаказовПокупателей)
		|			ТОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка)
		|		ИНАЧЕ ""Заказ-наряд""
		|	КОНЕЦ КАК Поле1,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Проведен
		|			ТОГДА 1
		|		КОГДА ДанныеДокумента.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Поле2
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаряд)
		|";
		
		ТекстЗапросаПоЗаказамПокупателей = СтрЗаменить(ТекстЗапросаПоЗаказамПокупателей, "Заказ-наряд", НСтр("ru = 'Заказ-наряд'"));
		
		ТекстЗапроса = ТекстЗапроса + ТекстЗапросаПоЗаказамПокупателей;
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.ОтчетКомиссионера) И СтрНайти(СтрокаИсключений, "ОтчетКомиссионера") = 0 Тогда
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" +
		"
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка,
		|	ДанныеДокумента.Дата,
		|	ДанныеДокумента.Номер,
		|	ДанныеДокумента.Организация,
		|	ДанныеДокумента.Контрагент,
		|	ДанныеДокумента.Договор,
		|	ДанныеДокумента.СуммаДокумента КАК Сумма,
		|	ДанныеДокумента.ВалютаДокумента,
		|	ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка),
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Проведен
		|			ТОГДА 1
		|		КОГДА ДанныеДокумента.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	Документ.ОтчетКомиссионера КАК ДанныеДокумента
		|";
		
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.ОтчетОПереработке) И СтрНайти(СтрокаИсключений, "ОтчетОПереработке") = 0 Тогда
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" +
		"
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка,
		|	ДанныеДокумента.Дата,
		|	ДанныеДокумента.Номер,
		|	ДанныеДокумента.Организация,
		|	ДанныеДокумента.Контрагент,
		|	ДанныеДокумента.Договор,
		|	ДанныеДокумента.СуммаДокумента,
		|	ДанныеДокумента.ВалютаДокумента,
		|	ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка),
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Проведен
		|			ТОГДА 1
		|		КОГДА ДанныеДокумента.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	Документ.ОтчетОПереработке КАК ДанныеДокумента
		|";
		
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.ПередачаВА) И СтрНайти(СтрокаИсключений, "ПередачаВА") = 0 Тогда
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" +
		"
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка,
		|	ДанныеДокумента.Дата,
		|	ДанныеДокумента.Номер,
		|	ДанныеДокумента.Организация,
		|	ДанныеДокумента.Контрагент,
		|	ДанныеДокумента.Договор,
		|	ДанныеДокумента.СуммаДокумента,
		|	ДанныеДокумента.ВалютаДокумента,
		|	ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка),
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Проведен
		|			ТОГДА 1
		|		КОГДА ДанныеДокумента.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	Документ.ПередачаВА КАК ДанныеДокумента
		|";
		
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.ПриходнаяНакладная) И СтрНайти(СтрокаИсключений, "ПриходнаяНакладная") = 0 Тогда
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" +
		"
		|ВЫБРАТЬ
		|	ПриходнаяНакладная.Ссылка,
		|	ПриходнаяНакладная.Дата,
		|	ПриходнаяНакладная.Номер,
		|	ПриходнаяНакладная.Организация,
		|	ПриходнаяНакладная.Контрагент,
		|	ПриходнаяНакладная.Договор,
		|	ПриходнаяНакладная.СуммаДокумента,
		|	ПриходнаяНакладная.ВалютаДокумента,
		|	ТИПЗНАЧЕНИЯ(ПриходнаяНакладная.Ссылка) КАК Поле1,
		|	ВЫБОР
		|		КОГДА ПриходнаяНакладная.Проведен
		|			ТОГДА 1
		|		КОГДА ПриходнаяНакладная.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Поле2
		|ИЗ
		|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
		|ГДЕ
		|	(ПриходнаяНакладная.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя)
		|			ИЛИ ПриходнаяНакладная.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтКомиссионера)
		|			ИЛИ ПриходнаяНакладная.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПереработчика)
		|			ИЛИ ПриходнаяНакладная.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратСОтветХранения))
		|";
		
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.РасходнаяНакладная) И СтрНайти(СтрокаИсключений, "РасходнаяНакладная") = 0 Тогда
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" +
		"
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка,
		|	ДанныеДокумента.Дата,
		|	ДанныеДокумента.Номер,
		|	ДанныеДокумента.Организация,
		|	ДанныеДокумента.Контрагент,
		|	ДанныеДокумента.Договор,
		|	ДанныеДокумента.СуммаДокумента,
		|	ДанныеДокумента.ВалютаДокумента,
		|	ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка),
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Проведен
		|			ТОГДА 1
		|		КОГДА ДанныеДокумента.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	Документ.РасходнаяНакладная КАК ДанныеДокумента
		|";
		
	КонецЕсли;
	
	// ЧекиККМ
	Если ПравоДоступа("Чтение", Метаданные.Документы.ЧекККМ) И СтрНайти(СтрокаИсключений, "ЧекККМ") = 0 Тогда
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" +
		"
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка КАК Ссылка,
		|	ДанныеДокумента.Дата КАК Дата,
		|	ДанныеДокумента.Номер КАК Номер,
		|	ДанныеДокумента.Организация КАК Организация,
		|	ДанныеДокумента.Контрагент КАК Контрагент,
		|	ДанныеДокумента.Договор КАК Договор,
		|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента,
		|	ДанныеДокумента.ВалютаДокумента КАК ВалютаДокумента,
		|	ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка) КАК Поле1,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Проведен
		|				И ДанныеДокумента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
		|			ТОГДА 1
		|		КОГДА ДанныеДокумента.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Поле2
		|ИЗ
		|	Документ.ЧекККМ КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.ОперацияСДенежнымиСредствами
		|";
		
	КонецЕсли;
	// Конец ЧекиККМ
	
	// Эквайринг
	Если ПравоДоступа("Чтение", Метаданные.Документы.ОперацияПоПлатежнымКартам) И СтрНайти(СтрокаИсключений, "ОперацияПоПлатежнымКартам") = 0 Тогда
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" +
		"
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка,
		|	ДанныеДокумента.Дата,
		|	ДанныеДокумента.Номер,
		|	ДанныеДокумента.Организация,
		|	ДанныеДокумента.Контрагент,
		|	&ДоговорПоУмолчанию КАК Договор,
		|	ДанныеДокумента.СуммаДокумента,
		|	ДанныеДокумента.ВалютаДенежныхСредств,
		|	ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка) КАК Поле1,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Проведен
		|			ТОГДА 1
		|		КОГДА ДанныеДокумента.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Поле2
		|ИЗ
		|	Документ.ОперацияПоПлатежнымКартам КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЭквайринга.ПоступлениеОплатыОтПокупателя)";
		
	КонецЕсли;
	// Конец Эквайринг
	
	// Интеркампани
	Если ПравоДоступа("Чтение", Метаданные.Документы.ПередачаТоваровМеждуОрганизациями) Тогда
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" +
		"
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка,
		|	ДанныеДокумента.Дата,
		|	ДанныеДокумента.Номер,
		|	ДанныеДокумента.Организация,
		|	ДанныеДокумента.КонтрагентПолучатель,
		|	ДанныеДокумента.Договор,
		|	ДанныеДокумента.СуммаДокумента,
		|	ДанныеДокумента.ВалютаДокумента,
		|	ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка),
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Проведен
		|			ТОГДА 1
		|		КОГДА ДанныеДокумента.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	Документ.ПередачаТоваровМеждуОрганизациями КАК ДанныеДокумента
		|";
		
	КонецЕсли;
	// Конец Интеркампани
	
	Если Лев(ТекстЗапроса, 10) = "ОБЪЕДИНИТЬ" Тогда
		ТекстЗапроса = Сред(ТекстЗапроса, 15);
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Получает запрос для выбора документов расчетов с поставщиками 
// для документов "Расход со счета" и "Расход из кассы".
//
&НаСервереБезКонтекста
Функция ПолучитьТекстЗапросаДокументыРасчетовСПоставщикамиСписание(ОтборПоДоговору)
	
	ТекстЗапроса = "";
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.ДополнительныеРасходы) Тогда
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка КАК Ссылка,
		|	ДанныеДокумента.Дата КАК Дата,
		|	ДанныеДокумента.Номер КАК Номер,
		|	ДанныеДокумента.Организация КАК Организация,
		|	ДанныеДокумента.Контрагент КАК Контрагент,
		|	ДанныеДокумента.Договор КАК Договор,
		|	ДанныеДокумента.СуммаДокумента КАК Сумма,
		|	ДанныеДокумента.ВалютаДокумента КАК Валюта,
		|	ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка) КАК Тип,
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Проведен
		|			ТОГДА 1
		|		КОГДА ДанныеДокумента.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СостояниеДокумента
		|ИЗ
		|	Документ.ДополнительныеРасходы КАК ДанныеДокумента
		|";
		
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.ПриходнаяНакладная) Тогда
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" +
		"
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка,
		|	ДанныеДокумента.Дата,
		|	ДанныеДокумента.Номер,
		|	ДанныеДокумента.Организация,
		|	ДанныеДокумента.Контрагент,
		|	ДанныеДокумента.Договор,
		|	ДанныеДокумента.СуммаДокумента,
		|	ДанныеДокумента.ВалютаДокумента,
		|	ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка),
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Проведен
		|			ТОГДА 1
		|		КОГДА ДанныеДокумента.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	Документ.ПриходнаяНакладная КАК ДанныеДокумента
		|";
		
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.РасходнаяНакладная) Тогда
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" +
		"
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка,
		|	ДанныеДокумента.Дата,
		|	ДанныеДокумента.Номер,
		|	ДанныеДокумента.Организация,
		|	ДанныеДокумента.Контрагент,
		|	ДанныеДокумента.Договор,
		|	ДанныеДокумента.СуммаДокумента,
		|	ДанныеДокумента.ВалютаДокумента,
		|	ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка),
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Проведен
		|			ТОГДА 1
		|		КОГДА ДанныеДокумента.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	Документ.РасходнаяНакладная КАК ДанныеДокумента
		|";
		
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.ОтчетКомитенту) Тогда
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" +
		"
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка,
		|	ДанныеДокумента.Дата,
		|	ДанныеДокумента.Номер,
		|	ДанныеДокумента.Организация,
		|	ДанныеДокумента.Контрагент,
		|	ДанныеДокумента.Договор,
		|	ДанныеДокумента.СуммаДокумента,
		|	ДанныеДокумента.ВалютаДокумента,
		|	ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка),
		|	ВЫБОР КОГДА ДанныеДокумента.Проведен ТОГДА
		|		1
		|	КОГДА ДанныеДокумента.ПометкаУдаления ТОГДА
		|		2
		|	ИНАЧЕ
		|		0
		|	КОНЕЦ
		|ИЗ
		|	Документ.ОтчетКомитенту КАК ДанныеДокумента
		|";
		
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.ОтчетПереработчика) Тогда
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" +
		"
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка,
		|	ДанныеДокумента.Дата,
		|	ДанныеДокумента.Номер,
		|	ДанныеДокумента.Организация,
		|	ДанныеДокумента.Контрагент,
		|	ДанныеДокумента.Договор,
		|	ДанныеДокумента.Сумма,
		|	ДанныеДокумента.ВалютаДокумента,
		|	ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка),
		|	ВЫБОР КОГДА ДанныеДокумента.Проведен ТОГДА
		|		1
		|	КОГДА ДанныеДокумента.ПометкаУдаления ТОГДА
		|		2
		|	ИНАЧЕ
		|		0
		|	КОНЕЦ
		|ИЗ
		|	Документ.ОтчетПереработчика КАК ДанныеДокумента
		|";
		
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.Взаимозачет) Тогда
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" +
		"
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка,
		|	ДанныеДокумента.Дата,
		|	ДанныеДокумента.Номер,
		|	ДанныеДокумента.Организация,
		|	ДанныеДокумента.Контрагент,
		|	&ДоговорПоУмолчанию,
		|	ДанныеДокумента.СуммаРасчетов,
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
		|	ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка),
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Проведен
		|			ТОГДА 1
		|		КОГДА ДанныеДокумента.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	Документ.Взаимозачет КАК ДанныеДокумента
		|";
		
	КонецЕсли;
	
	// Интеркампани
	Если ПравоДоступа("Чтение", Метаданные.Документы.ПередачаТоваровМеждуОрганизациями) Тогда
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" +
		"
		|ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка,
		|	ДанныеДокумента.Дата,
		|	ДанныеДокумента.Номер,
		|	ДанныеДокумента.ОрганизацияПолучатель,
		|	ДанныеДокумента.КонтрагентВладелец,
		|	ДанныеДокумента.Договор,
		|	ДанныеДокумента.СуммаДокумента,
		|	ДанныеДокумента.ВалютаДокумента,
		|	ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка),
		|	ВЫБОР
		|		КОГДА ДанныеДокумента.Проведен
		|			ТОГДА 1
		|		КОГДА ДанныеДокумента.ПометкаУдаления
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	Документ.ПередачаТоваровМеждуОрганизациями КАК ДанныеДокумента
		|";
		
	КонецЕсли;
	// Конец Интеркампани
	
	Если Лев(ТекстЗапроса, 10) = "ОБЪЕДИНИТЬ" Тогда
		ТекстЗапроса = Сред(ТекстЗапроса, 14);
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти
